hubertciebiada/VdMot_Controller/software_esp32/src/stmApp.cpp
void CStmApp::scanTemps()
{
    tempsCount=0;
    for (uint8_t i=0;i<TEMP_SENSORS_COUNT;i++) {
        memset(tempsId[i].id,0x0,sizeof(tempsId[i].id));
    }
    app_cmd(APP_PRE_SETONEWIRESEARCH);
}

void CStmApp::matchSensors()
{
    if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
        syslog.log(LOG_DEBUG, "stmApp: send match sensor request");
    }
    #ifdef EnvDevelop
        UART_DBG.println("stmApp: send match sensor request");
    #endif
    app_cmd(APP_PRE_MATCHSENS);      
}

void CStmApp::setTempIdx()
{
    String s1;
    String s2;
    uint8_t tIdx1;
    uint8_t tIdx2;
    
    for (uint8_t i=0;i<ACTUATOR_COUNT;i++) {
        tIdx1=StmApp.actuators[i].tIdx1;
        tIdx2=StmApp.actuators[i].tIdx2;
        s1=APP_PRE_UNDEFSENSOR;
        s2=APP_PRE_UNDEFSENSOR;
        if (tIdx1>0) {
            if (strlen(VdmConfig.configFlash.tempsConfig.tempConfig[tIdx1-1].ID)>0) {
                s1=VdmConfig.configFlash.tempsConfig.tempConfig[tIdx1-1].ID;
            }   
        }
        if (tIdx2>0) {
            if (strlen(VdmConfig.configFlash.tempsConfig.tempConfig[tIdx2-1].ID)>0) {
                s2=VdmConfig.configFlash.tempsConfig.tempConfig[tIdx2-1].ID; 
            }
        }
        
        waitForFinishQueue=true;
        fastQueueMode=true;
        waitEEPFinished=true;
        UART_DBG.println("tIdx : "+String(i+1)+"="+String(tIdx1)+":"+s1+","+String(tIdx2)+s2);
        app_cmd(APP_PRE_SETVLVSENSOR,String(i)+ARG_DELIMITER+s1+ARG_DELIMITER+s2);

        fastQueueMode=true;

        if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
            syslog.log(LOG_DEBUG,"stmApp: "+String(APP_PRE_SETVLVSENSOR)+" "+String(i)+ARG_DELIMITER+s1+ARG_DELIMITER+s2);
        }
    }
    fastQueueMode=true;
}

void CStmApp::setLearnAfterMovements()
{
    waitForFinishQueue=true;
    waitEEPFinished=true;
    app_cmd(APP_PRE_SETLEARNMOVEM,String(learnAfterMovements));
    fastQueueMode=true;   
}

void CStmApp::setMotorChars()
{
    waitForFinishQueue=true;
    waitEEPFinished=true;
    app_cmd(APP_PRE_SETMOTCHARS,String(motorChars.maxLowCurrent)+ARG_DELIMITER+String(motorChars.maxHighCurrent)+
        ARG_DELIMITER+String(motorChars.startOnPower)+ARG_DELIMITER+String(motorChars.noOfMinCount)+ARG_DELIMITER+String(motorChars.maxCalReps));   
    fastQueueMode=true;
}

void  CStmApp::app_loop() 
{
    static int match_counter = 0;

    app_check_data();
    appHandler();

    // maybe find a better place for this code
    if(matchSensorRequest == true) {
        match_counter++;
        if (match_counter > 30) {
            match_counter = 0;
            matchSensorRequest = false;
            matchSensors();
        }
    }
}

bool CStmApp::checkCmdIsAvailable (String thisCmd)
{   
    uint8_t i=0;
    while (commCmds[i] != NULL) {
        if (strncmp(thisCmd.c_str(),commCmds[i],5)==0) {
            return(true);
        }
        i++;
    }
    #ifdef EnvDevelop
        UART_DBG.println("Command not found "+String(thisCmd));
    #endif
    return (false);
}

void  CStmApp::app_cmd(String command,String args) 
{    
    if (checkCmdIsAvailable(command)) {
        String s=command+ARG_DELIMITER;
        if (args!="") s+=args+ARG_DELIMITER;
        #ifdef EnvDevelop
            UART_DBG.println("push "+s);
        #endif
        Queue.push(s);
    }
    else {
        if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_ATOMIC) {
            syslog.log(LOG_DEBUG, "STMApp: app_cmd - command not found");
        }
    }
}

int8_t CStmApp::findTempID(char* ID) 
{
    for (uint8_t i=0;i<TEMP_SENSORS_COUNT;i++) {
        if (strlen(VdmConfig.configFlash.tempsConfig.tempConfig[i].ID)>0) {
            if (strncmp(ID,VdmConfig.configFlash.tempsConfig.tempConfig[i].ID,sizeof(VdmConfig.configFlash.tempsConfig.tempConfig[i].ID))==0) {
            return (i);
            }
        }
    }
    return -1;
}

int8_t CStmApp::findVoltID(char* ID) 
{
    for (uint8_t i=0;i<VOLT_SENSORS_COUNT;i++) {
        if (strlen(VdmConfig.configFlash.voltsConfig.voltConfig[i].ID)>0) {
            if (strncmp(ID,VdmConfig.configFlash.voltsConfig.voltConfig[i].ID,sizeof(VdmConfig.configFlash.voltsConfig.voltConfig[i].ID))==0) {
            return (i);
            }
        }
    }
    return -1;
}

int8_t CStmApp::findTempIdxInValve (uint8_t tempIdx)
{
  uint8_t idx=0;
  for (uint8_t i=0;i<ACTUATOR_COUNT;i++) {
    if ((StmApp.actuators[i].tIdx1==tempIdx+1) || (StmApp.actuators[i].tIdx2==tempIdx+1)) return (i);
  }
  return (-1);
}


void CStmApp::setSensorIndex(uint8_t valveIndex,char* sensor1,char* sensor2)
{
    int8_t sensorIdx;
    if (valveIndex>=ACTUATOR_COUNT) return;
    sensorIdx=findTempID(sensor1);
    if (sensorIdx>=0) actuators[valveIndex].tIdx1=sensorIdx+1; else actuators[valveIndex].tIdx1=0;
    sensorIdx=findTempID(sensor2);
    if (sensorIdx>=0) actuators[valveIndex].tIdx2=sensorIdx+1; else actuators[valveIndex].tIdx2=0;
}

void  CStmApp::app_check_data() 
{
    static int errorcnt = 0;
    static bool rxOverflow = false;
    uint8_t noToken;
    uint8_t val8;
    String sv;

    #ifdef STMSimulation
        #warning STMSimulation active
        appState=APP_IDLE;  
        stmStatus=STM_READY; 
        cmd_buffer=""; 
        return;
    #endif

    found=false;
    bool rxActivity = false;

    // Assemble one line per call. Bytes after the terminator stay in the UART
    // buffer for the next call, so back-to-back replies are not lost. A line
    // longer than the buffer is dropped completely instead of overrunning it.
    while (!found && (UART_STM32.available() > 0)) {
        char c = (char) UART_STM32.read();
        rxActivity = true;
        if ((c == '\r') || (c == '\n')) {
            if (rxOverflow) {
                syslog.log(LOG_DEBUG, "STMApp: line exceeds receive buffer, dropped");
                rxOverflow = false;
                buflen = 0;
            } else if (buflen >= 5) {       // shortest valid reply is a 5-char command
                buffer[buflen] = '\0';
                errorcnt = 0;
                found = true;
                buflen = 0;
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_ATOMIC) {
                    syslog.log(LOG_DEBUG, "STMApp:found new data packet: >" + String(buffer) + "<");
                }
            } else {
                buflen = 0;                 // empty line, LF of CR LF or noise
            }
        } else if (rxOverflow) {
            // discard until the end of the oversized line
        } else if (buflen < sizeof(buffer)-1) {
            buffer[buflen++] = c;
        } else {
            rxOverflow = true;
        }
    }

    // timeout incomplete recv sequences (no new byte for ~6 cycles)
    if (!found && ((buflen > 0) || rxOverflow)) {
        if (rxActivity) errorcnt = 0; else errorcnt++;
        if (errorcnt > 5) {
            buffer[buflen] = '\0';
            syslog.log(LOG_DEBUG, "incomplete buffer : >" + String(buffer) + "<");
            errorcnt = 0;
            buflen = 0;
            rxOverflow = false;
        }
    }
   
    if(!found) 
    {
        //syslog.log(LOG_DEBUG, "incomplete buffer : >" + String(buffer) + "<");
    }
    else 
    {
        found = false;

