hubertciebiada/VdMot_Controller/software_esp32/src/stmApp.cpp
                int8_t idx=findTempID(argptr[0]);
                if (idx>=0) {
                    memset(temps[idx].id,0x0,sizeof(temps[idx].id)); 
                    strlcpy(temps[idx].id,argptr[0],sizeof(temps[idx].id));
                    int16_t cValue=atoi(argptr[1]);
                    temps[idx].temperature=ConvertCF(cValue)+VdmConfig.configFlash.tempsConfig.tempConfig[idx].offset;
                } 
                tempIndex++;
                
                if (tempIndex>=tempsCount) {  // all temp sensors read
                    tempIndex=0;
                    fastGetOneWire=false;
                    if (VdmTask.piTaskInitiated) oneWireAllRead=true;
                }
                #ifdef AppDebug
                    UART_DBG.println("read temp onwire "+String(tempIndex)+":"+String(fastGetOneWire));
                #endif
            }
            // handle incomplete messages to not block 1-wire request cycle
            else if(argcnt == 1) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"STMApp:one wire temp data - only 1 arg");
                }
                tempIndex++;
                if (tempIndex>=tempsCount) {  // all temp sensors read
                    tempIndex=0;
                    fastGetOneWire=false;
                    if (VdmTask.piTaskInitiated) oneWireAllRead=true;
                }
            }
            appState=APP_IDLE;
        }

        // get volt onewire data answer
		// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
        
        else if(memcmp(APP_PRE_GETOWVOLTCNT,cmd,5) == 0) {
            if(argcnt == 1) {
                voltsPrivCount= constrain(atoi(argptr[0]),0,VOLT_SENSORS_COUNT); 
                // "N 0" is also the reply to the list request on an empty bus
                if (voltsPrivCount==0) voltsCount=0;
                if (voltsPrivCount!=voltsCount) app_cmd(APP_PRE_GETOWVOLTCNT,String(255));
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"STMApp:one wire volt count "+String(voltsPrivCount));
                }       
            }
            if(argcnt == 2) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"STMApp:one wire volt data "+String(argptr[1]));
                } 
                int nItems= constrain(atoi(argptr[0]),0,VOLT_SENSORS_COUNT);
                int idx=0;
                char* cmdptr;
                char* ps=argptr[1];
                while (idx<nItems) {
                    if ((cmdptr=strchr(ps,','))!=NULL) *cmdptr='\0';
                    strlcpy(voltsId[idx].id,ps,sizeof(voltsId[idx].id));
                    idx++;
                    if (cmdptr==NULL) break;    // list shorter than announced
                    ps=cmdptr+1;
                }
                voltsPrivCount=idx;
                voltsCount=voltsPrivCount;
            }
            if (voltsPrivCount==0) {
                fastGetOneWire=false;
               // oneWireAllRead=true;
            }
            appState=APP_IDLE;
        }

		else if(memcmp(APP_PRE_GETOWVOLTDATA,cmd,5) == 0) {
            if(argcnt == 2) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"STMApp:one wire volt data "+String(argptr[0])+":"+String(argptr[1]));
                } 
                strlcpy(voltsId[voltIndex].id,argptr[0],sizeof(voltsId[voltIndex].id));

                int8_t idx=findVoltID(argptr[0]);
                if (idx>=0) {
                    memset(volts[idx].id,0x0,sizeof(volts[idx].id)); 
                    strlcpy(volts[idx].id,argptr[0],sizeof(volts[idx].id));
                    volts[idx].vad=atoi(argptr[1]);
                    volts[idx].failed=(volts[idx].vad<=-1000);
                    float c = (float) volts[idx].vad;
                    volts[idx].value=(c/100.0+VdmConfig.configFlash.voltsConfig.voltConfig[idx].offset) * VdmConfig.configFlash.voltsConfig.voltConfig[idx].factor;
                } 
                voltIndex++;
                
                
                if (voltIndex>=voltsCount) {  // all volt sensors read
                    voltIndex=0;
                    fastGetOneWire=false;
                    if (VdmTask.piTaskInitiated) oneWireAllRead=true;
                }
                #ifdef AppDebug
                    UART_DBG.println("read onwire "+String(tempIndex)+":"+String(fastGetOneWire));
                #endif
            }
            // handle incomplete messages to not block 1-wire request cycle
            else if(argcnt == 1) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"STMApp:one wire data - only 1 arg");
                }
                voltIndex++;
                if (voltIndex>=voltsCount) {  // all volt sensors read
                    voltIndex=0;
                    fastGetOneWire=false;
                    if (VdmTask.piTaskInitiated) oneWireAllRead=true;
                }
            }
            appState=APP_IDLE;
        }

        else if(memcmp(APP_PRE_GETVERSION,cmd,5) == 0) {
            if(argcnt > 0) {
                VdmSystem.stmVersion=argptr[0]; 
                VdmSystem.stmBuild=0;
            }

            if(argcnt > 1) {
                 VdmSystem.stmBuild=atoi(argptr[1]);
            }
            #ifdef minSTMRequired
                int8_t pos;
                pos=VdmSystem.stmVersion.indexOf('_');
                sv=VdmSystem.stmVersion;
                if (pos>=0) sv.remove(pos);
                VdmSystem.stmNRevision=versionExplode(sv);
                VdmSystem.stmMinRequired=versionExplode(minSTMRequired);
                VdmSystem.stmVersionFalse=VdmSystem.stmNRevision<VdmSystem.stmMinRequired;
            #endif
            if (strncmp(cmd,cmd_buffer.c_str(),5) ==0) cmd_buffer="";
            appState=APP_IDLE;
        }

        else if(memcmp(APP_PRE_GETHWINFO,cmd,5) == 0) {
            if(argcnt > 0) {
                VdmSystem.stmID=atoi(argptr[0]); 
            }
            if (strncmp(cmd,cmd_buffer.c_str(),5) ==0) cmd_buffer="";
            appState=APP_IDLE;
        }

        else if(memcmp(APP_PRE_GETONEWIRESETT,cmd,5) == 0) {
            if(argcnt == 3) {
                int idx=atoi(argptr[0]);
                if ((idx>=0) && (idx<ACTUATOR_COUNT)) setSensorIndex(idx,argptr[1],argptr[2]);
            }
            if(argcnt == 2) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"STMApp:one wire settings data "+String(argptr[0])+" : "+String(argptr[1]));
                }   
                int nItems= atoi(argptr[0]);
                if (nItems > ACTUATOR_COUNT) nItems = ACTUATOR_COUNT;
                if (nItems>0) {
                    char* cmdptr;
                    char* ps=argptr[1];
                    
                    for (int idx=0; idx<nItems;idx++) {
                        if ((cmdptr=strchr(ps,','))==NULL) break;   // list shorter than announced
                        *cmdptr='\0';
                        strlcpy(argptr[4],ps,argSize[4]);
                        ps=cmdptr+1;
                        if ((cmdptr=strchr(ps,','))!=NULL) *cmdptr='\0';
                        strlcpy(argptr[5],ps,argSize[5]); 
                        setSensorIndex(idx,argptr[4],argptr[5]);
                        if (cmdptr==NULL) break;
                        ps=cmdptr+1;
                    }
                }
                
