hubertciebiada/VdMot_Controller/software_esp32/src/stmApp.cpp
                            app_comm_send(APP_PRE_SETTARGETPOS,&x, &(actuators[x].target_position));
                            pendingTargetValve=x;
                            #ifdef EnvDevelop
                                UART_DBG.println("valve position has changed : "+String(x)+" = "+String(actuators[x].target_position));
                            #endif
                            // break loop, next valve will be served in next cycle
                            appState=APP_PENDING;
                            break;

                            timeout = 10;
                        }   
                    }
                }
                
                break;

        // check correct transmission of target value
        case COMM_CHECKTARGET:
                if (timeout>0) timeout--;
                else {
                    // answer received
                    if (settarget_check) {                        
                        commstate = COMM_GETDATA; 
                    }
                    else {
                        if (retry>0) retry--;
                        else commstate = COMM_GETDATA; 
                        commstate = COMM_SENDTARGET;
                    }
                }
                
                break;

        case COMM_GETDATA:  
                // ask for the EEPROM state only after the queued commands went out,
                // so a 'done' reply covers their EEPROM writes too
                if ((eepState!=EEP_IDLE) && (Queue.available()==0)) {
                    commstate =  COMM_GETEEPSTATE;
                } else {
                    commstate =  COMM_GETONEWIRECOUNT;
                }
                // walk through all valves, one per cycle
                if (getindex<ACTUATOR_COUNT-1) getindex++; else getindex=0;
               
                app_comm_send(APP_PRE_GETVLVDATA,&getindex);

                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG, "STMApp cmd = "+String(sendbuffer));
                }
                appState=APP_PENDING;
                break;

        case COMM_GETEEPSTATE :
            #ifdef EnvDevelop
                UART_DBG.println("request eeprom state");
            #endif
            app_comm_send(APP_PRE_EEPSTATE);
            appState=APP_PENDING;
            commstate = COMM_GETONEWIRECOUNT;   // continue the cycle, incl. the queue
            break;

        case COMM_GETONEWIRECOUNT:
                if (tempsPrivCount>0) {
                    commstate = COMM_GETONEWIRE;
                } else {
                    commstate =  COMM_GETOWVOLTCOUNT;   
                }
                if (checkTempsCount==0) {
                    app_comm_send(APP_PRE_GETONEWIRECNT);
                    checkTempsCount=20;
                    appState=APP_PENDING;

                    if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                        syslog.log(LOG_DEBUG,"get one wire temp count");
                    } 
                }    
                checkTempsCount--;
                break;

        case COMM_GETONEWIRE:
            if (!fastGetOneWire) commstate = COMM_GETOWVOLTCOUNT;
                if (tempsPrivCount>0) {
                    app_comm_send(APP_PRE_GETONEWIREDATA,&tempIndex);
                    appState=APP_PENDING;

                    if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                        syslog.log(LOG_DEBUG,"get one wire temp data: " + String(sendbuffer));
                    } 
                }
                break;

         case COMM_GETOWVOLTCOUNT:
                if (voltsPrivCount>0) {
                    commstate = COMM_GETOWVOLT;
                } else {
                    commstate =  COMM_HANDLEQUEUE;   
                }
                if (checkVoltsCount==0) {
                    app_comm_send(APP_PRE_GETOWVOLTCNT);
                    checkVoltsCount=20;
                    appState=APP_PENDING;

                    if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                        syslog.log(LOG_DEBUG,"get one wire volt count");
                    } 
                }    
                checkVoltsCount--;
                break;

        case COMM_GETOWVOLT:
            if (!fastGetOneWire) commstate = COMM_HANDLEQUEUE;
                if (voltsPrivCount>0) {
                    app_comm_send(APP_PRE_GETOWVOLTDATA,&voltIndex);
                    appState=APP_PENDING;

                    if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                        syslog.log(LOG_DEBUG,"get one wire volt data: " + String(sendbuffer));
                    } 
                }
                break;


        case COMM_HANDLEQUEUE:
                if ((cmd_buffer=="") && (Queue.available()>0) && (stmStatus>=STM_READY)) {
                    cmd_buffer=Queue.pop();
                    #ifdef EnvDevelop
                        UART_DBG.println("pop "+String(cmd_buffer));
                    #endif
                    UART_STM32.println(cmd_buffer);
                    appState=APP_PENDING;
                }
                if (fastQueueMode) {
                    if (Queue.available()==0) {
                        fastQueueMode=false;
                        commstate = COMM_IDLE;
                    }
                } else commstate =COMM_IDLE;
                
                break;
        
        default:    
                commstate = COMM_IDLE;
                break;
    }
}